---
kind: property
id: P:Autodesk.Revit.DB.ConicalFace.HalfAngle
source: html/60f57ad6-6e50-74f2-c488-dd8ea15ac324.htm
---
# Autodesk.Revit.DB.ConicalFace.HalfAngle Property

Half angle of the surface.

## Syntax (C#)
```csharp
public double HalfAngle { get; }
```